1. HTML5 표준에 따라 HTML 페이지에 반드시 있어야 하는 것이 아닌 것은? [ 2번 ]

2. HTML 언어에서 사용되는 옳은 주석문은? [ 3번 ]

3. 다음 중 틀린 것은? <img width='100' height="35' alt=심청 src:shrek.png> [ 4번 ]

4. href 속성을 가지지 않는 태그는? [ 1번 ]

5. target 속성을 가지지 않는 태그는? [ 4번 ]

6. src 속성을 가지지 않는 태그는? [ 4번 ]

7. 다음 중 블록형 태그가 아닌 것은? [ 4번 ]

8. 웹 페이지의 제작자를 표현하기 위해 사용되는 태그는? [ 2번 ]

9. 웹 페이지를 만드는 이유를 "자바에 대해 알려주려고"라고 웹 페이지 내에 적어 넣고자 한다. 가장 적절한 태그는? 태그를 완성하라. [ `` ]

10. <base> 태그를 이용하여 베이스 URL을 지정하고, 이 두 <a> 태그를 간략히 다시 작성하라.

<base href="http://www.mysite.com/html/design/">
<a href="dress.html">옷</a>
<a href="shoes.html">신발</a>

11. 웹 페이지에 다음 정보를 작성하려고 한다. 다음 각 경우에 <ol>, <ul>, <dl> 태그 중 어떤 것이 적합한가? [(1) <ul> (2) <ol> (3) <dl>]

12. 링크 텍스트는 처음에 [ 파란 ] 색으로 출력된다. 사용자가 일단 방문한 후에는 [ 보라 ] 색으로 출력되고,
    방문하기 위해 마우스를 누르고 있는 동안만 [ 빨간 ] 색으로 출력된다.

13.HTML 페이지에 다른 HTML 페이지를 삽입하기 위해 사용되는 태그는? [ 1번 ]

14. 다음은 오류가 있는 HTML5 문서이다. 틀린 부분을 찾아 완성하라.

1) <!doctype html> 선언 추가, </body> 추가
2) <h3> 태그를 </h3>로 닫아줌

15. HTML5 문서에서 사용하지 않는 것이 바람직한 태그는? [3번]

16. <source> 태그를 사용하여 다음 문장을 수정하라.

<audio controls>
<source src="hello.mp3" type="audio/mpeg">
오디오를 지원하지 않습니다.
</audio>

17. 다음에 작성된 HTML 태그의 의도를 자세히 설명하라.

320x240 크기의 비디오 플레이어를 삽입하고, 컨트롤러를 표시하며, 자동 재생되도록 설정합니다.
브라우저 호환성을 위해 mp4와 ogg 두 가지 형식의 영상을 제공하고, <video> 태그를 지원하지 않는 환경에서는 대체 텍스트를 보여주려는 의도입니다.
